Repository: dEAduction/dEAduction
Catalog: src/deaduction/share/locales/*/LC_MESSAGES/deaduction.po
Languages: fr_fr

source: Path {} does not point to an exploitable file
fr_fr: Le chemin {} ne pointe pas vers un fichier exploitable

source: Checking path: {}
fr_fr: Vérification du chemin {}

source: → Creating directory {}
fr_fr: → Création du dossier {}

source: Generate hashlist from directory at {}
fr_fr: Liste de fonctions de hachage engendrée depuis le dossier {}

source: Ignoring non regular file {}
fr_fr: Fichier irrégulier {} ignoré

source: Load hashlist from path {}
fr_fr: Chargement de la liste de hachage depuis le chemin {}

source: Cannot parse line: {}
fr_fr: Impossible de lire la ligne : {}

source: Progress : {:03d}%
fr_fr: Progression : {:03d}%

source: Download from {} to {}
fr_fr: Téléchargé depuis {} vers {}

source: Run dEAduction
fr_fr: Démarrer d∃∀duction
