Repository: dEAduction/dEAduction
Catalog: src/deaduction/share/locales/*/LC_MESSAGES/deaduction.po
Languages: fr_fr

source: Provide a witness for an existential property
fr_fr: Fournir un témoin pour une propriété existentielle

source: Introduce the new object {}
fr_fr: Introduire le nouvel objet {}

source: Introduce a new sub-goal
fr_fr: Introduire un but intermédiaire

source: Enter a property
fr_fr: Entrez une propriété

source: Proof by cases
fr_fr: Preuve par cas

source: Define an object
fr_fr: Introduire un nouvel objet

source: Apply a function
fr_fr: Appliquer une fonction

source: Complete hypothesis and goal
fr_fr: Compléter l'hypothèse et le but

source: Complete goal
fr_fr: Compléter le but

source: Complete hypothesis
fr_fr: Compléter l'hypothèse

source: Apply the universal context property:
fr_fr: Appliquer la propriété universelle du contexte :

source: Apply the universal statement:
fr_fr: Appliquer l'énoncé universel :

source: Provide a witness for the existential property:
fr_fr: Fournir un témoin pour la propriété existentielle :

source: State a new sub-goal:
fr_fr: Introduire un but intermédiaire :

source: Enter the element of {} on which the function will be applied:
fr_fr: Entrer l’élément de {} sur lequel la fonction sera appliquée :

source: Enter a property:
fr_fr: Entrez une propriété :

source: Introduce a new object: {} = ?
fr_fr: Introduire un nouvel objet : {} = ?

source: Enter {}:
fr_fr: Entrer {} :

source: Enter an object:
fr_fr: Entrer un objet

source: Which object plays the role of {}?
fr_fr: Quel objet joue le rôle de {} ?

source: To which object shall we apply this property?
fr_fr: A quel objet allons-nous appliquer cette propriété ?

source: Complete hypothesis {}
fr_fr: Compléter l'hypothèse {}

source: Complete your joker
fr_fr: Compléter votre joker

source: a property
fr_fr: une propriété

source: Go into 'use mode' to make use of {} of the context
fr_fr: Passer en 'Mode Utiliser' pour utiliser {} du contexte

source: Press the 'use' button to make use of {} of the context
fr_fr: Appuyer sur le bouton 'Utiliser' pour utiliser {} du contexte

source: the goal
fr_fr: le but

source: Go into 'prove mode' to prove {}
fr_fr: Passer en 'Mode Démontrer' pour démontrer {}

source: Press the 'prove' button to prove {}
fr_fr: Appuyer sur le bouton 'Démontrer' pour démontrer {}

source: Select at least one object, one property or the target
fr_fr: Sélectionner au moins un objet, une propriété ou bien le but

source: I do not know what to do with this selection
fr_fr: Je n’ai pas compris ce que vous voulez faire :-(

source: Definition applied to target
fr_fr: Définition appliquée au but

source: Definition applied to
fr_fr: Définition appliquée à

source: Theorem applied to target
fr_fr: Théorème appliqué au but

source: Theorem applied to
fr_fr: Théorème appliqué à

source: Exercise applied to target
fr_fr: Exercice appliqué au but

source: Exercise applied to
fr_fr: Exercice appliqué à

source: Definition added to the context
fr_fr: Définition ajoutée au contexte

source: Theorem added to the context
fr_fr: Théorème ajouté au contexte

source: Exercise added to the context
fr_fr: Exercice ajouté au contexte

source: Unable to apply definition
fr_fr: La définition n’a pas pu être appliquée

source: Target replaced by applying theorem
fr_fr: Le but a été remplacé en appliquant le théorème

source: Target replaced by applying theorem to
fr_fr: Le but a été remplacé en appliquant le théorème à

source: Theorem
fr_fr: Théorème

source: applied to
fr_fr: appliqué à

source: Unable to apply theorem
fr_fr: Le théorème n’a pas pu être appliqué

source: Select at least one property
fr_fr: Sélectionner au moins une propriété

source: To prove this universal property
fr_fr: Pour démontrer cette propriété universelle

source: Object {} added to the context
fr_fr: Objet {} ajouté au contexte

source: a universal property '∀x, P(x)'
fr_fr: une propriété universelle ‘∀x, P(x)’

source: Target is not a universal property '∀x, P(x)'
fr_fr: Le but n’est pas une propriété universelle ‘∀x, P(x)’

source: Selected property is not a universal property '∀x, P(x)'
fr_fr: La propriété sélectionnée n’est pas une propriété universelle ‘∀x, P(x)’

source: Select one object to apply the property
fr_fr: Sélectionner un objet pour appliquer la propriété

source: No universal property among selected
fr_fr: Pas de propriété universelle dans la sélection

source: Now prove {} suits our needs
fr_fr: Il reste à démontrer que {} convient

source: an existential property '∃x, P(x)'
fr_fr: une propriété existentielle ‘∃x, P(x)’

source: Select a property on {} to get an existential property
fr_fr: Sélectionner une propriété sur {} pour obtenir une propriété existentielle

source: To use this existential property
fr_fr: Pour utiliser cette propriété existentielle

source: New object {} with property {}
fr_fr: Nouvel objet {} vérifiant la propriété {}

source: I cannot build an existential property with this
fr_fr: Ceci ne me permet pas de construire une propriété existentielle

source: Get new existential property {}
fr_fr: Nouvelle propriété existentielle {}

source: Target is not an existential property '∃x, P(x)'
fr_fr: Le but n’est pas une propriété existentielle ‘∃x, P(x)’

source: Enter an object to prove existence
fr_fr: Entrer un objet pour démontrer l'existence

source: Selection is not an existential property '∃x, P(x)'
fr_fr: L’objet sélectionné n’est pas une propriété existentielle ’∃x, P(x)’

source: I do not know what to do
fr_fr: Je n’ai pas compris ce que vous voulez faire :-(

source: If you want to use a joker as witness, just select the target
fr_fr: Pour utiliser un joker comme témoin, sélectionner seulement le but

source: To prove this existential property
fr_fr: Pour démontrer cette propriété existentielle

source: You can now go on with the proof, and decide later what {} should be
fr_fr: Vous pouvez continuer la preuve, et décider plus tard ce que vaut {}

source: Target is not an implication 'P ⇒ Q'
fr_fr: Le but n’est pas une implication ‘P ⇒ Q’

source: Target modified using implication {}
fr_fr: But modifié à l’aide de l’implication {}

source: You need to select another property in order to use one direction of this equivalence
fr_fr: Pour utiliser un sens de cette équivalence logique, vous devez sélectionner une seconde propriété

source: To use this equivalence, you first have to prove one of both properties
fr_fr: Pour utiliser cette équivalence logique, vous devez d'abord démontrer l'une des deux propriétés

source: Prove {} as a premise
fr_fr: Démontrer la prémisse {}

source: You need to select another property in order to use this implication
fr_fr: Pour utiliser cette implication, vous devez sélectionner une seconde propriété

source: To use this implication, you need the premise "{}". Do you want to prove it?
fr_fr: Pour utiliser cette implication, il vous faut la prémisse "{}". Voulez-vous la démontrer ?

source: We cannot use an implication without a premise
fr_fr: Nous ne pouvons pas utiliser une implication sans prémisse

source: an implication 'P ⇒ Q'
fr_fr: une implication ‘P ⇒ Q’

source: Selected property is not an implication 'P ⇒ Q'
fr_fr: La propriété sélectionnée n’est pas une implication ‘P ⇒ Q’

source: Selected properties are not implications 'P ⇒ Q'
fr_fr: Les propriétés sélectionnées ne sont pas des implications ‘P ⇒ Q’

source: Does not apply to more than two properties
fr_fr: Ne s’applique pas à plus de deux propriétés

source: Target is not a conjunction 'P AND Q'
fr_fr: Le but n’est pas une conjonction ‘P ET Q’

source: Left
fr_fr: Gauche

source: Right
fr_fr: Droite

source: Prove a conjunction
fr_fr: Démontrer une conjonction

source: Which property to prove first?
fr_fr: Quelle propriété voulez-vous démontrer en premier ?

source: Target split
fr_fr: On décompose le but

source: Split property {} into {} and {}
fr_fr: Propriété {} découpée en {} et {}

source: Conjunction {} added to the context
fr_fr: Conjonction {} ajoutée au contexte

source: a conjunction 'P AND Q'
fr_fr: une conjonction ‘P ET Q’

source: Selected property is not a conjunction 'P AND Q'
fr_fr: La propriété sélectionnée n’est pas une conjonction ‘P ET Q’

source: Selected items are not properties
fr_fr: Les objets sélectionnés ne sont pas des propriétés

source: Prove a disjunction
fr_fr: Démontrer une disjonction

source: Which property will you prove?
fr_fr: Quelle propriété voulez-vous démontrer ?

source: Target replaced by the left alternative
fr_fr: But remplacé par l’alternative de gauche

source: Target replaced by the right alternative
fr_fr: But remplacé par l’alternative de droite

source: Use a conjunction
fr_fr: Utiliser une conjonction

source: Which case to assume first?
fr_fr: Quel cas voulez-vous étudier en premier ?

source: None of the hypotheses if a disjunction 'P OR Q'
fr_fr: Aucune des propriétés sélectionnées n'est une disjonction ‘P OU Q’

source: I do not know how to use disjunction {} with {}
fr_fr: Je ne sais pas utiliser la disjonction {} avec {}

source: Selected item is not a property
fr_fr: L’objet sélectionné n’est pas une propriété

source: Obtain 'P OR Q'
fr_fr: Obtenir ‘P OU Q’

source: On which side do you want
fr_fr: De quel côté voulez-vous

source: a disjunction 'P OR Q'
fr_fr: une disjonction ‘P OU Q’

source: Target is not a disjunction 'P OR Q'
fr_fr: Le but n’est pas une disjonction ‘P OU Q’

source: Negation cannot be pushed in target
fr_fr: Impossible de « pousser » la négation dans le but

source: Negation pushed on target
fr_fr: Négation « poussée » sur le but

source: Negation cannot be pushed in selected property
fr_fr: Impossible de « pousser » la négation dans la propriété sélectionnée

source: Negation pushed on property {}
fr_fr: Négation « poussée » sur la propriété {}

source: Only one property at a time
fr_fr: Seulement une propriété à la fois

source: Use for substitution in {}
fr_fr: Utiliser pour substituer dans {}

source: Use an equality/equivalence
fr_fr: Utiliser une égalité / équivalence

source: Choose which equality to use for substitution
fr_fr: Choisissez l’égalité à utiliser pour la substitution

source: Prove an equivalence
fr_fr: Démontrer une équivalence

source: Which implication to prove first?
fr_fr: Quelle implication voulez-vous démontrer en premier ?

source: Iff split in two implications
fr_fr: Equivalence séparée en deux implications

source: Target replaced by iff property
fr_fr: But remplacé par une équivalence

source: The first implication is not the converse of the second one
fr_fr: Les deux implications ne sont pas réciproques l’une de l’autre

source: Property {} split into {} and {}
fr_fr: Propriété {} séparée en {} et {}

source: Logical equivalence {} added to the context
fr_fr: Equivalence {} ajoutée au contexte

source: Target is not an iff property 'P ⇔ Q'
fr_fr: Le but n’est pas un « si et seulement si » ‘P ⇔ Q’

source: Selected property is not an iff property 'P ⇔ Q'
fr_fr: La propriété sélectionnée n’est pas un « si et seulement si » ‘P ⇔ Q’

source: Selected items should both be implications
fr_fr: Les objets sélectionnés ne sont pas deux implications

source: {} replaced by {}
fr_fr: {} remplacé par {}

source: Substitution using {}
fr_fr: Substitution à l’aide de {}

source: in {}
fr_fr: dans {}

source: Unable to substitute {} by {}
fr_fr: Impossible de remplacer {} par {}

source: Unable to use {} to substitute in {}
fr_fr: Impossible d’utiliser {} pour substituer dans {}

source: Replace by {}
fr_fr: Remplacer par {}

source: Choose which expression you want to replace
fr_fr: Choisissez quelle expression remplacer

source: Select an equality to perform a substitution
fr_fr: Choisissez une égalité pour effectuer une substitution

source: To prove an equality between sets, use the relevant definitions, not the = button
fr_fr: Pour prouver une égalité entre ensembles, utilisez les définitions pertinentes, pas le bouton =

source: Select an equality from the context to perform a substitution
fr_fr: Choisissez une égalité du contexte pour effectuer une substitution

source: Too many selected objects
fr_fr: Appliquer cette propriété à un objet sélectionné

source: This cannot be used for substitution
fr_fr: Cette propriété ne peut pas être utilisé pour la substitution

source: New objet {} added to the context
fr_fr: Nouvel objet {} ajouté au contexte

source: Map {} applied to {}
fr_fr: La fonction {} a été appliquée à {}

source: The map {} cannot be applied to this object
fr_fr: L’application {} ne peut pas être appliquée à cet objet

source: The map {} cannot be applied to these objects
fr_fr: L’application {} ne peut pas être appliquée à ces objets

source: Select an application and an element or an equality
fr_fr: Sélectionner une application, et un élément ou une égalité

source: The proof cannot be complete until you complete all jokers
fr_fr: On ne peut pas conclure tant qu'il reste des jokers

source: The proof cannot be complete until you complete jokers in the goal
fr_fr: On ne peut pas conclure tant qu'il reste des jokers dans le but

source: I don't know how to conclude
fr_fr: Je ne sais pas comment conclure

source: Case-based reasoning
fr_fr: Raisonnement par cas

source: Proof by contraposition
fr_fr: Preuve par contraposée

source: Proof by contradiction
fr_fr: Preuve par l’absurde

source: Proof by induction
fr_fr: Preuve par récurrence

source: Admit current sub-goal!
fr_fr: Admettre le but en cours !

source: Proof methods
fr_fr: Méthodes de preuve…

source: Which proof method?
fr_fr: Quelle méthode de preuve ?

source: Selected property is not a disjunction
fr_fr: La propriété sélectionnée n’est pas une disjonction ‘P OU Q’

source: Target replaced by contrapositive
fr_fr: Le but est remplacé par sa contraposée

source: Proof by contraposition only applies when target is an implication
fr_fr: La preuve par contraposée n’est pas possible, le but n’est pas une implication

source: Proof by contraposition with hypothesis {}
fr_fr: Preuve par contraposée avec l’hypothèse {}

source: Selected object should be a property
fr_fr: L’objet sélectionné devrait être une propriété

source: There should be at most one selected property
fr_fr: Il devrait y avoir au plus une propriété selctionnée

source: Negation of target added to the context
fr_fr: La négation du but est ajoutée au contexte

source: Proof by contradiction only applies to target
fr_fr: La preuve par l’absurde ne s’applique qu’au but

source: Proof by induction only applies to prove a universal property '∀n∈ℕ, P(n)'
fr_fr: La preuve par récurrence ne peut démontrer qu'une propriété universelle '∀n∈ℕ, P(n)'

source: proof by induction does not apply
fr_fr: Impossible de faire une preuve par récurrence

source: Base case
fr_fr: Initialisation

source: Induction step
fr_fr: Hérédité

source: This is pertinent only when there are several targets
fr_fr: Cette méthode est utile seulement lorsqu'il y a plusieurs buts

source: Select a property "∀ x, ∃ y, P(x,y)" to get a function
fr_fr: Sélectionner une propriété du type « ∀ x, ∃ y, P(x,y) » pour obtenir une fonction

source: Function {} and property {} added to the context
fr_fr: La fonction {} et la propriété {} sont ajoutées au contexte

source: Object
fr_fr: Objet

source: Introduce a new object
fr_fr: Introduire un nouvel objet

source: Goal
fr_fr: But

source: Introduce a new intermediate sub-goal
fr_fr: Introduire un but intermédiaire

source: Function
fr_fr: Fonction

source: Introduce a new function
fr_fr: Introduire une nouvelle fonction

source: Choose what to introduce:
fr_fr: Choisissez :

source: New notation
fr_fr: Nouvelle notation

source: Choose a notation for your new object:
fr_fr: Choisissez une notation pour votre nouvel objet :

source: This name already exists, please give a new name:
fr_fr: Ce nom existe déjà, choisissez un nouveau nom:

source: New object {} added to the context
fr_fr: Nouvel objet {} ajouté au contexte

source: You might try the ∀ button...
fr_fr: Vous pouvez essayer le bouton ‘∀’…

source: You cannot use {} to define {}!
fr_fr: On ne peut pas utiliser {} pour définir {} !

source: You cannot use variable {} to define {}, since it did not exist when {} was created
fr_fr: impossible d'utiliser la variable {} pour définir {}, puisqu'elle a été introduite après la création de {}

source: You cannot use variables {} to define {}, since they did not exist when {} was created
fr_fr: impossible d'utiliser les variables {} pour définir {}, puisqu'elles ont été introduites après la création de {}

source: There is nothing to complete
fr_fr: Il n'y a rien à compléter

source: Complete the equality to replace the joker
fr_fr: Compléter l'égalité pour remplacer le joker

source: Unexpected user input
fr_fr: Entrée utilisateur inattendue

source: Let us try
fr_fr: Essayons

source: No joker completed
fr_fr: Aucun joker n'a été complété

source: Your proposal is correct!
fr_fr: Votre proposition est correcte !

source: Everything you entered is correct!
fr_fr: Tout ce que vous avez proposé est correct!

source: There is no syntax error but I suspect it is not correct
fr_fr: Il n'y a pas d'erreur de syntaxe mais je soupçonne que ça n'est pas correct

source: Error:
fr_fr: Erreur :

source: I do not understand your proposal, maybe a syntax error?
fr_fr: Je ne comprends pas votre proposition, peut-être une erreur de syntaxe ?

source: Drop on some object or property!
fr_fr: Déposer sur un objet ou une propriété !

source: Drag and drop failed, please try again.
fr_fr: Le glisser-déposer a échoué, ré-essayez.

source: I don't know what to do!
fr_fr: Je n’ai pas compris ce que vous voulez faire :-(

source: Check packages installation
fr_fr: Vérification de l’installation des paquets

source: Failed checking package {}: {}
fr_fr: Echec dans la vérification du paquet {}: {}

source: No package {} found in configuration
fr_fr: Paquet {} non trouvé dans la configuration

source: Could not get config value:
fr_fr: Impossible d’obtenir la valeur du fichier de configuration :

source: Saving configuration file
fr_fr: Sauvegarde du fichier de configuration

source: target
fr_fr: But

source: no description
fr_fr: pas de description

source: except
fr_fr: sauf

source: Author(s)
fr_fr: Auteurice(s)

source: Not
fr_fr: Non

source: All
fr_fr: Tous

source: Those before the current exercise
fr_fr: Ceux précédents l’exercice

source: With open questions
fr_fr: Avec des questions ouvertes

source: "Magic" buttons
fr_fr: Boutons « magiques »

source: "Logic" buttons
fr_fr: Boutons « logiques »

source: "Proof" buttons
fr_fr: Boutons « preuve »

source: "Compute" buttons
fr_fr: Boutons de calcul

source: Exercises in statements list
fr_fr: Exercices dans la liste d’énoncés

source: (Computing statement, please wait...)
fr_fr: (Calcul de l'énoncé, patientez...)

source: implicit use allowed
fr_fr: peut être utilisée implicitement

source: definition
fr_fr: définition

source: theorem
fr_fr: théorème

source: exercise
fr_fr: exercice

source: Bound variables
fr_fr: Variables liées

source: Context
fr_fr: Contexte

source: and
fr_fr: et

source: are disjoint
fr_fr: sont disjoints

source: connected
fr_fr: connexe

source: converging
fr_fr: convergente

source: non decreasing
fr_fr: croissante

source: non increasing
fr_fr: décroissante

source: increasing
fr_fr: croissante

source: decreasing
fr_fr: décroissante

source: strictly increasing
fr_fr: strictement croissante

source: strictly decreasing
fr_fr: strictement décroissante

source: continuous
fr_fr: continue

source: uniformly continuous
fr_fr: uniformément continue

source: bounded from above
fr_fr: majorée

source: bounded from below
fr_fr: minorée

source: bounded
fr_fr: borné

source: a Cauchy sequence
fr_fr: une suite de Cauchy

source: continuous at
fr_fr: continue au point

source: an equivalence relation
fr_fr: une relation d’équivalence

source: a partition
fr_fr: une partition

source: an application
fr_fr: une application

source: a bijective application
fr_fr: une application bijective

source: even
fr_fr: pair

source: odd
fr_fr: impair

source: divides
fr_fr: divise

source: sqrt
fr_fr: racine

source: prime
fr_fr: premier

source: relatively prime
fr_fr: premiers entre eux

source: a power of 2
fr_fr: une puissance de 2

source: multiple of
fr_fr: multiple de

source: some inequality
fr_fr: une égalité

source: some number
fr_fr: un nombre

source: some integer
fr_fr: un entier relatif

source: some set
fr_fr: un ensemble

source: set
fr_fr: ensemble

source: metric space
fr_fr: espace métrique

source: not
fr_fr: non

source: subset of
fr_fr: partie de

source: sequence in
fr_fr: suite dans

source: family of subsets of
fr_fr: famille de parties de

source: element of
fr_fr: élément de

source: point of
fr_fr: point de

source: non-negative integer
fr_fr: entier positif ou nul

source: integer
fr_fr: entier relatif

source: rational number
fr_fr: nombre rationnel

source: real number
fr_fr: nombre réel

source: or
fr_fr: ou

source: if and only if
fr_fr: si et seulement si

source: the negation of
fr_fr: la négation de

source: if
fr_fr: si

source: then
fr_fr: alors

source: the set of subsets of
fr_fr: l’ensemble des parties de

source: a proposition
fr_fr: une proposition

source: the set of propositions
fr_fr: l'ensemble des propositions

source: a set
fr_fr: un ensemble

source: a metric space
fr_fr: un espace métrique

source: such that
fr_fr: tel que

source: for every
fr_fr: pour tout

source: for every subset {} of {}, {}
fr_fr: pour toute partie {} de {}, {}

source: for every function {} from {} to {}, {}
fr_fr: pour toute fonction {} de {} dans {}, {}

source: for every proposition {}, {}
fr_fr: pour toute proposition {}, {}

source: there exists
fr_fr: il existe

source: there exists a subset {} of {} such that {}
fr_fr: il existe une partie {} de {} telle que {}

source: there exists a function {} from {} to {} such that {}
fr_fr: il existe une fonction {} de {} dans {} telle que {}

source: there exists a proposition {} such that {}
fr_fr: il existe une proposition {} telle que {}

source: there exists a set {} such that {}
fr_fr: il existe un ensemble {} tel que {}

source: there exists a unique
fr_fr: il existe un unique

source: there exists a unique subset {} of {} such that {}
fr_fr: il existe une unique partie {} de {} telle que {}

source: there exists a unique function {} from {} to {} such that {}
fr_fr: il existe une unique fonction {} de {} dans {} telle que {}

source: there exists a unique proposition {} such that {}
fr_fr: il existe une unique proposition {} telle que {}

source: there exists a unique set {} such that {}
fr_fr: il existe un unique ensemble {} tel que {}

source: a function from
fr_fr: une fonction de

source: a sequence in
fr_fr: une suite dans

source: in
fr_fr: dans

source: is
fr_fr: est

source: is not
fr_fr: n’est pas

source: are
fr_fr: sont

source: are not
fr_fr: ne sont pas

source: a subset of
fr_fr: une partie de

source: a family of subsets of
fr_fr: une famille de parties de

source: an element of
fr_fr: un élément de

source: a point of
fr_fr: un point de

source: a non-negative integer
fr_fr: un entier positif ou nul

source: an integer
fr_fr: un entier relatif

source: a rational number
fr_fr: un nombre rationnel

source: a real number
fr_fr: un nombre réel

source: one
fr_fr: un

source: two
fr_fr: deux

source: three
fr_fr: trois

source: four
fr_fr: quatre

source: five
fr_fr: cinq

source: seven
fr_fr: sept

source: eight
fr_fr: huit

source: nine
fr_fr: neuf

source: ten
fr_fr: dix

source: Let {} be {}
fr_fr: Soit {} {}

source: Let {} be {} {}
fr_fr: Soient {} {} {}

source: sets
fr_fr: ensembles

source: a subset
fr_fr: une partie

source: subsets
fr_fr: parties

source: an element
fr_fr: un élément

source: elements
fr_fr: éléments

source: a function
fr_fr: une fonction

source: functions
fr_fr: fonctions
