Repository: dEAduction/dEAduction
Catalog: src/deaduction/share/locales/*/LC_MESSAGES/deaduction.po
Languages: fr_fr

source: No connection! Maybe your wifi is off?
fr_fr: Pas de connexion ! Le wifi est peut-être désactivé ?

source: Wrong url!
fr_fr: Mauvaise url !

source: Download interrupted!
fr_fr: Téléchargement interrompu !

source: Download interrupted by user.
fr_fr: Téléchargement interrompu par l’utilisateur.

source: Missing packages have been installed, but user decided to quit without launching d∃∀duction.
fr_fr: Les dépendances manquantes ont été installées, mais l’utilisateur a décidé de quitter sans lancer d∃∀duction.

source: Quitting d∃∀duction
fr_fr: Quitter d∃∀duction

source: Language test
fr_fr: Test de langue

source: Ambiguous name
fr_fr: Nom ambigu

source: File has the same name as {}.
fr_fr: Il existe un autre fichier du même nom : {}.

source: Change the name of one of the two files and try again.
fr_fr: Modifier le nom du fichier, et réessayer.

source: The following files share the same name:
fr_fr: Les fichiers suivants ont le même nom:

source: Show details
fr_fr: Détails

source: Cancel
fr_fr: Annuler

source: Proceed anyway
fr_fr: Commencer l'exercice

source: Button
fr_fr: Bouton

source: Prove mode
fr_fr: Mode Démontrer

source: Use mode
fr_fr: Mode Utiliser

source: Prove:
fr_fr: Démontrer :

source: Use:
fr_fr: Utiliser :

source: saved on
fr_fr: sauvegarde du

source: steps
fr_fr: étapes

source: Exercises
fr_fr: Exercices

source: Saved proofs
fr_fr: Sauvegardes

source: Statements
fr_fr: Enoncés

source: The variables of the context are displayed in color
fr_fr: Les variables du contexte apparaissent en couleur

source: The dummy variables (bound by a quantifier) are displayed in color
fr_fr: Les variables muette (liées à un quantificateur) apparaissent en couleur

source: The context properties are shaded after the first time they are used
fr_fr: Les propriétés du contexte sont grisées après avoir été utilisées une première fois

source: The user is asked to name new context variables
fr_fr: L'utilisateur doit nommer les nouvelles variables du contexte

source: Display properties using bounded quantification
fr_fr: Utiliser la quantification bornée

source: Allow to use a joker as witness to prove an existential property
fr_fr: Utiliser un joker comme témoin pour démontrer une propriété existentielle

source: 'Admit current sub-goal!' is available with the Proof methods button
fr_fr: 'Admettre le but en cours !' est possible avec le bouton 'Méthodes de preuve'

source: When an existence property appears in the context, the ∃ button is operated automatically
fr_fr: Lorsqu'une propriété d'existence apparait dans le contexte, le bouton ∃ est actionné automatiquement

source: When a conjunction appears in the context, the AND button is operated automatically
fr_fr: Lorsqu'une conjonction apparait dans le contexte, le bouton AND est actionné automatiquement

source: Buttons act on the target if no context object is selected
fr_fr: Les boutons agissent sur le but si aucune propriété du contexte n'a été sélectionnée

source: e.g. the ∀ button applies on properties like 'A⊂B', which is a universal property by implicitly applying the definition of inclusion
fr_fr: Par exemple, le bouton ∀ agit sur une propriété comme 'A⊂B', qui est vue comme une propriété universelle en appliquant implicitement la définition d'inclusion

source: e.g. when applying '∀ε>0, P(ε)' to some ε, the computer tries to prove ε>0
fr_fr: Si on applique, par exemple, '∀ε>0, P(ε)' à un nombre ε, l'ordinateur essaie de démontrer ε>0

source: Objects and properties of the context may be dragged and dropped on each other, e.g. drag and drop 'x∈A' on 'A⊂B' to get 'x∈B'
fr_fr: Les objets et propriétés du contexte peuvent être glissées et déposées les unes sur les autres, par exemple déposer 'x∈A' sur 'A⊂B' pour obtenir 'x∈B'

source: Properties of the context may be dragged and dropped on statements, typically a definition, e.g. drag and drop 'A⊂B' on the definition of inclusion
fr_fr: Les propriétés du contexte peuvent être glissées et déposées sur un énoncé, typiquement sur une définition : par exemple, déposer 'x∈A' sur 'A⊂B' pour obtenir 'x∈B'

source: Statements may be dragged and dropped in the context properties area, where they become a context property that may be applied with more precision
fr_fr: Les énoncés peuvent être glissés et déposés dans la zone des propriétés du contexte, où ils deviennent une propriété qui peut être utilisée plus finement

source: When an implication 'P ⇒ Q' appears in the context, the computer asks user if she wants to prove P as a sub-goal
fr_fr: Lorsqu'une implication 'P ⇒ Q' apparait dans le contexte, l'ordinateur demande à l'utilisatrice si elle veut démontrer P comme un but intermédiaire

source: The ∀ and ⇒ buttons are operated automatically when the target is a universal property or an implication
fr_fr: Les boutons ∀ et ⇒ sont automatiquement actionnés lorsque le but est une propriété universelle ou une implication

source: Choose in which order to prove the two sub-goals of a conjunction
fr_fr: Choisir l'ordre dans lequel on prouve les deux termes d'une conjonction

source: Choose in which order to study the two cases of a disjunction
fr_fr: Choisir l'ordre dans lequel on étudie les deux cas d'une disjonction

source: Open the logical calculator to enter composite objects
fr_fr: Ouvrir la calculatrice logique pour entrer des objets composites

source: Save all the statements to a text file in .deaduction/text_files
fr_fr: Sauvegarder les énoncés dans un fichier texte dans le dossier .deaduction/text_files

source: Preferences
fr_fr: Préférences

source: Save preferences for next session
fr_fr: Sauvegarder les préférences

source: Apply
fr_fr: Appliquer

source: Wrong settings!
fr_fr: Valeurs incorrectes !

source: Free settings
fr_fr: Choix libres

source: Browse directories
fr_fr: Choisir un dossier

source: Missing characters: Enter exactly {} strings separated by commas
fr_fr: Caractères manquants : entrer exactement {} groupes de caractères séparés par des virgules

source: Replace missing symbols: ℕ (N), ℤ (Z), ℚ (Q), ℝ (R), 𝒫 (P), ↦ (->)
fr_fr: Remplacer les symboles manquants : ℕ (N), ℤ (Z), ℚ (Q), ℝ (R), 𝒫 (P), ↦ (->)

source: Functionalities
fr_fr: Fonctionnalités

source: Display
fr_fr: Affichage

source: Logic
fr_fr: Logique

source: Language
fr_fr: Langue

source: Advanced
fr_fr: Avancé

source: Select language
fr_fr: Sélectionner la langue

source: Target display on top
fr_fr: Objectif en haut de la fenêtre

source: Main font size
fr_fr: Taille de la police principale

source: Font size for statements
fr_fr: Taille de la police pour les énoncés

source: Tooltips font size
fr_fr: Taille de la police pour les info-bulles

source: Target font size
fr_fr: Taille de la police pour le but

source: Font size for global proof view
fr_fr: Taille de la police pour l'aperçu de preuve

source: Set directory for choosing courses
fr_fr: Dossier pour le choix de cours

source: Lean request method
fr_fr: Méthode pour les requêtes Lean

source: automatic
fr_fr: Automatique

source: from_previous_proof_state
fr_fr: A partir de l'état de preuve précédent

source: Level of logs
fr_fr: Niveau de logs

source: Use symbol for logic buttons
fr_fr: Symboles pour les boutons logiques

source: Font size for symbol buttons
fr_fr: Taille des symboles pour les boutons logiques

source: Display success messages
fr_fr: Afficher les messages de succès

source: Color for selection
fr_fr: Couleur des éléments sélectionnés

source: Color for applied properties
fr_fr: Couleur des propriétés utilisées

source: Maths fonts
fr_fr: Police pour les maths

source: Prove / use mode for action buttons
fr_fr: Mode démontrer / utiliser pour les boutons logiques

source: Display switcher
fr_fr: Afficher le commutateur

source: Display both buttons
fr_fr: Afficher les deux boutons

source: Display unified buttons
fr_fr: Afficher un bouton unique

source: Use color for variables
fr_fr: Variables en couleur

source: Use color for dummy variables
fr_fr: Variables muettes en couleur

source: Use color for applied properties
fr_fr: Griser les propriétés déjà utilisées

source: Target selected by default
fr_fr: But sélectionné par défaut

source: Allow proof by sorry
fr_fr: Admettre le but en cours est autorisé

source: Allow implicit use of definitions
fr_fr: Autoriser les définitions implicites

source: Automatic intro of variables and hypotheses
fr_fr: Introduction automatique des variables et des hypothèses

source: Automatically destruct existence context properties
fr_fr: Destruction automatique des propriétés existentielles

source: Automatic destruct context conjunctions
fr_fr: Destruction automatique des conjonctions du contexte

source: Save history when exercise is solved
fr_fr: Sauver l'historique lorsqu'un exercice est résolu

source: Try to silently prove ε>0 when applying '∀ε>0'
fr_fr: Essayer de démontrer ε>0 quand on applique '∀ε>0'

source: Ask to prove 'P' when 'P ⇒ Q' in context
fr_fr: Proposer de prouver 'P' quand 'P ⇒ Q' dans le contexte

source: Logical calculator
fr_fr: Calculatrice logique

source: Allow jokers
fr_fr: Jokers

source: Save journal
fr_fr: Sauvegarder le journal

source: Split logic buttons into two lines
fr_fr: Boutons logiques sur deux lignes

source: Drag statements to context
fr_fr: Glisser les énoncés dans le contexte

source: Drag and drop in context
fr_fr: Glisser-déposer dans le contexte

source: Drag context to statements
fr_fr: Glisser du contexte vers les énoncés

source: None
fr_fr: Aucun(e)

source: Beginner
fr_fr: Débutant

source: Intermediate
fr_fr: Intermédiaire

source: Bounded quantification: denote ∀x>0, ... instead of ∀x∈ℝ, (x>0 ⇒ ...)
fr_fr: Quantification bornée : noter ∀x>0, ... à la place de ∀x∈ℝ, (x>0 ⇒ ...)

source: Choose the order when proving a conjunction
fr_fr: Choisir l'ordre lorsqu'on prouve une conjonction

source: Choose the order when using a disjunction
fr_fr: Choisir l'ordre lorsqu'on utilise une disjonction

source: Ask user to name variables
fr_fr: L'utilisateur nomme les variables

source: Save all statements to text file
fr_fr: Sauvegarder les énoncés dans un fichier texte

source: To be proved
fr_fr: A démontrer

source: Target
fr_fr: But

source: ({} pending)
fr_fr: ({} en attente)

source: Objects:
fr_fr: Objets :

source: Properties:
fr_fr: Propriétés :

source: True or False:
fr_fr: Vrai ou faux :

source: Target:
fr_fr: But :

source: Text mode
fr_fr: Mode texte

source: Help
fr_fr: Aide

source: Previous help message
fr_fr: Message précédent

source: Next help message
fr_fr: Message suivant

source: Show hint!
fr_fr: Voir la suggestion !

source: Help n°{}
fr_fr: Aide n°{}

source: No object selected
fr_fr: Pas d'objet sélectionné

source: Double click on context or target to get some help.
fr_fr: Double-cliquer sur le but ou sur un élément du contexte pour obtenir de l'aide.

source: No help available on this object.
fr_fr: Aucune aide disponible sur cet objet.

source: Hint:
fr_fr: Suggestion :

source: Code sent to Lean
fr_fr: Code envoyé à Lean

source: Send to L∃∀N
fr_fr: Envoyer à L∃∀N

source: Objects involved
fr_fr: Objets utilisés

source: List of proof steps
fr_fr: Liste des étapes de la preuve

source: Expand all
fr_fr: Tout déplier

source: Move to selected step
fr_fr: Aller

source: THE END
fr_fr: FIN !

source: (admitted)
fr_fr: (admis)

source: QED!!
fr_fr: CQFD !!

source: Goal!
fr_fr: But !

source: ( ... under construction... )
fr_fr: (... preuve à compléter...)

source: Global proof view
fr_fr: Aperçu global de la preuve

source: (browsed)
fr_fr: (navigué)

source: Thinking
fr_fr: Je réfléchis

source: Initializing
fr_fr: Initialisation

source: Reminder of the exercise statement
fr_fr: Rappel de l'énoncé de l'exercice

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Yes or no? — d∃∀duction
fr_fr: Oui ou non ? — d∃∀duction

source: Do not show again
fr_fr: Ne plus montrer

source: Undo all
fr_fr: Tout annuler

source: Undo
fr_fr: Annuler

source: Redo
fr_fr: Rétablir

source: Redo all
fr_fr: Tout rétablir

source: Go to beginning
fr_fr: Aller au début

source: Move left
fr_fr: Aller à gauche

source: Expand selection
fr_fr: Etendre la sélection

source: Shrink selection
fr_fr: Réduire la sélection

source: Move right
fr_fr: Aller à droite

source: Go to end
fr_fr: Aller à la fin

source: Delete selected block
fr_fr: Effacer la sélection

source: Number mode
fr_fr: Nombres

source: Full mode
fr_fr: Propriétés

source: Logical Calculator
fr_fr: Calculatrice logique

source: <div>Use the Logical Calculator to fill-in the form.<br> </div><div>Please note the green selection: when you click a calculator button, the corresponding operator will apply to the selection.<br> </div><div>Use the Enlarge (up) and Shrink (down) arrows to modify the selection.</div>
fr_fr: <div>Utilisez la Calculatrice Logique pour remplir le formulaire.<br> </div><div>Notez la sélection en vert : quand vous cliquez sur un bouton de la calculatrice, l'opérateur correspondant s'applique à la sélection.<br> </div><div>Utilisez les flèches haut ("Elargir") et bas ("Réduire") pour modifier la sélection.</div>

source: <div>Use the Logical Calculator to enter a property.<br></div><div>The proof will successively examines the case when the property is verified, and the case when it is not.<br> </div>
fr_fr: <div>Utilisez la calculatrice logique pour entrer une propriété.<br></div><div>La preuve examinera successivement le cas où la propriété est vérifiée, et le cas où elle ne l'est pas.<br> </div>

source: Enter {}
fr_fr: Entrer {}

source: (No help available)
fr_fr: (Pas d'aide disponible)

source: Cannot insert {} here
fr_fr: Impossible d'insérer {} ici

source: (type {})
fr_fr: (taper {})

source: type
fr_fr: taper

source: Enlage selection
fr_fr: Elargir la sélection

source: Raw editor (Lean)
fr_fr: Editeur brut (Lean)

source: is not correct
fr_fr: n’est pas correct

source: Server restarted
fr_fr: Redémarrage du serveur

source: No action to be cancelled, press again to restart server
fr_fr: Aucune action à annuler, appuyer à nouveau pour redémarrer le serveur

source: Prove premise?
fr_fr: Démontrer la prémisse ?

source: Do you want to prove the <b>premise</b><br><CENTER>{}</CENTER><br>as a new sub-goal?
fr_fr: Voulez-vous démontrer la <b>prémisse</b><br><CENTER>{}</CENTER><br>en tant que nouveau but ?

source: Error
fr_fr: Erreur

source: I've got a headache, try again...
fr_fr: Je n’y arrive pas, mais vous pouvez ré-essayer !

source: Unicode error, try again...
fr_fr: Erreur de mémoire, ré-essayez !

source: Unable to get new proof_state
fr_fr: Impossible d'obtenir le nouvel état de preuve

source: (File unchanged)
fr_fr: (Fichier non modifié)

source: Action cancelled
fr_fr: Action annulée

source: Undocumented error
fr_fr: Erreur non documentée

source: Change exercise
fr_fr: Changer d’exercice

source: Save history
fr_fr: Sauver l'historique

source: Statement completed
fr_fr: L'énoncé a été complété

source: The statement is correct! You can now go on to prove it.
fr_fr: L'énoncé est correct ! Vous pouvez maintenant le démontrer.

source: The statement is correct!
fr_fr: L'énoncé est correct !

source: Target solved
fr_fr: But atteint

source: The proof is complete!
fr_fr: La preuve est terminée !

source: Back to exercise
fr_fr: Retour à l’exercice

source: Context (objects and properties) #{history_nb}
fr_fr: Contexte (objets et propriétés) n°{history_nb}

source: Context (objects and properties)
fr_fr: Contexte (objets et propriétés)

source: Compute (experimental):
fr_fr: Calculer (expérimental) :

source: Actions (logical rules and statements)
fr_fr: Actions (règles logiques et énoncés)

source: Actions and statements (transform context and target)
fr_fr: Actions et énoncés (transforment le contexte et le but)

source: <div>The properties that have already been used in the proof are shaded in the context.<br> </div><div>Note that this does <b>not</b> prevent you from using them again!<br> </div>
fr_fr: <div>Les propriétés qui ont été utilisées au cours de la preuve apparaissent en grisé dans le contexte.<br> </div> <div>Ceci <b>ne</b> vous empêche <b>pas</b> de les ré-utiliser !<br></div>

source: <div>The new objects or properties appear in bold in the context.<br> </div>
fr_fr: <div>Les objets ou propriétés nouvelles apparaissent en gras dans le contexte.<br></div>

source: Toolbar
fr_fr: Barre d’outils

source: Jump to beginning of proof
fr_fr: Aller au début de la preuve

source: Undo action
fr_fr: Annuler l’action

source: Redo action
fr_fr: Refaire l’action

source: Jump to end of proof
fr_fr: Aller à la fin de la preuve

source: Toggle proof outline
fr_fr: Fil de preuve

source: Toggle proof global view
fr_fr: Aperçu global de preuve

source: Toggle L∃∀N
fr_fr: Console L∃∀N

source: Toggle help window
fr_fr: Fenêtre d'aide

source: Toggle proof tree
fr_fr: Arbre de preuve

source: Stop me from thinking!
fr_fr: Arrêter la requête

source: Settings
fr_fr: Paramètres

source: Save proof
fr_fr: Sauvegarder la preuve

source: Exercise
fr_fr: Exercice

source: Exercise history
fr_fr: Historique de l’exercice

source: Current target solved
fr_fr: But en cours atteint

source: Current goal solved
fr_fr: But en cours atteint

source: goals solved!
fr_fr: buts atteints !

source: Missing dependencies
fr_fr: Dépendances manquants

source: Some necessary dependencies are missing. Do you want to install them? (If not, d∃∀duction will stop.)
fr_fr: Il manque des dépendances indispensables. Voulez-vous les installer ? (Dans le cas contraire, d∃∀duction s’arrêtera.)

source: Installing — d∃∀duction
fr_fr: Installation — d∃∀duction

source: Quit
fr_fr: Quitter

source: Start d∃∀duction
fr_fr: Démarrer d∃∀duction

source: Missing dependencies installed.
fr_fr: Dépendances manquantes installées.

source: All downloaded data will be lost.
fr_fr: Toutes les données téléchargées seront perdues.

source: Do you really want to quit?
fr_fr: Voulez-vous vraiment quitter ?

source: No preview yet.
fr_fr: Aperçu indisponible.

source: Details:
fr_fr: Détails :

source: Browse all files...
fr_fr: Parcourir tous les fichiers…

source: Recent files
fr_fr: Fichiers récents

source: Preset files
fr_fr: Fichiers pré-sélectionnés

source: File selector
fr_fr: Sélecteur de fichier

source: No file selected! Select a '.lean' file
fr_fr: Pas de fichier sélectionné ! Sélectionner un fichier ".lean"

source: Preview not available (be patient...)
fr_fr: Chargement en cours (patientez…)

source: (saved proof)
fr_fr: (sauvegarde)

source: Start exercise
fr_fr: Commencer la preuve

source: Files
fr_fr: Fichiers

source: Show only recent files
fr_fr: Afficher seulement les fichiers récents

source: Show saved proofs
fr_fr: Afficher les sauvegardes

source: Delete saved proofs
fr_fr: Effacer les sauvegardes

source: Load proof
fr_fr: Charger la démonstration

source: Deleting all saved proofs?
fr_fr: Effacer toutes les sauvegardes ?

source: This will delete ALL saved proofs for this file. Are you sure about this?
fr_fr: Ceci effacera TOUTES les sauvegarde pour ce fichier. Est-ce bien ce que vous voulez ?

source: Deleting all saved proofs
fr_fr: Effacer toutes les sauvegardes

source: This will delete ALL saved proofs for this exercise. Are you sure about this?
fr_fr: Ceci effacera TOUTES les sauvegarde pour cet exercice. Est-ce bien ce que vous voulez ?

source: Deleting a saved proof
fr_fr: Effacer une sauvegarde

source: Do you want to delete this saved proof?
fr_fr: Voulez-vous effacer cette sauvegarde ?

source: Choose file and exercise — d∃∀duction
fr_fr: Choisir le fichier et l’exercice — d∃∀duction

source: Welcome to the d∃∀duction file and exercise selector. Select a file in the 'Files' tab, then select your exercise in the 'Exercises' tab.
fr_fr: Bienvenu dans le sélecteur de fichier et d'exercice de d∃∀duction. Choisissez un fichier dans l'onglet "Fichiers", puis un exercice dans l'onglet "Exercices".

source: Use the toolbar to display recent files and saved exercises.
fr_fr: Utilisez la barre d'outils pour afficher les fichiers récents et les exercices sauvegardés.

source: True or False?
fr_fr: Vrai ou faux ?

source: Do you want to prove this statement or its negation?
fr_fr: Voulez-vous démontrer cet énoncé ou bien sa négation ?

source: Prove statement
fr_fr: Démontrer l’énoncé

source: Prove negation
fr_fr: Démontrer la négation

source: Test console
fr_fr: Console de test

source: Next step
fr_fr: Etape suivante

source: Scroll to end
fr_fr: Défiler en bas

source: Principle of induction
fr_fr: Principe de récurrence

source: Property {} added to the context
fr_fr: Propriété {} ajoutée au contexte

source: Unable to apply the selected property
fr_fr: La propriété sélectionnée n’a pas pu être appliqué

source: Action not available
fr_fr: Action non disponible

source: New target will be added to the context after being proved
fr_fr: Le nouveau but sera ajouté au contexte quand il aura été démontré

source: Property {} will be added to the context
fr_fr: La propriété {} sera ajoutée au contexte

source: after we check {}
fr_fr: après avoir vérifié {}

source: This name already exists in the context, please give a new name for
fr_fr: Ce nom existe déjà dans le contexte, choisissez un nouveau nom pour

source: New object
fr_fr: Nouvel Objet

source: choose a name for
fr_fr: Choisissez un nom pour

source: Select inequalities, equalities or numbers from the context to add them
fr_fr: Choisissez deux inégalités, égalités ou nombres du contexte pour les ajouter

source: Adding {} to {} to get {}
fr_fr: On additionne {} et {} pour obtenir {}

source: I cannot add {} to {}
fr_fr: Je ne sais pas additionner {} et {}

source: I cannot add {} and {}
fr_fr: Je ne sais pas additionner {} et {}

source: Select just one or two inequalities, equalities or numbers
fr_fr: Choisissez au plus deux inégalités, égalités ou nombres du contexte pour soustraire ou prendre l'opposé

source: Select inequalities, equalities or numbers from the context to substract them
fr_fr: Choisissez une ou deux inégalités, égalités ou nombres du contexte pour les soustraire ou prendre leur opposé

source: I cannot take the opposite of {}
fr_fr: Je ne sais pas prendre l'opposé de {}

source: I cannot substract {} and {}
fr_fr: Je ne sais pas soustraire {} et {}

source: I cannot chain {} and {}
fr_fr: Je ne sais pas enchainer {} et {}

source: Apply commutation on target
fr_fr: Commutativité appliquée au but

source: Apply commutation on {}
fr_fr: Commutativité appliquée à {}

source: I don't know how to apply commutation.
fr_fr: Je ne sais pas comment appliquer la commutativité

source: Apply associativity on target
fr_fr: Associativité appliquée au but

source: I don't know how to apply associativity.
fr_fr: Je ne sais pas comment appliquer l'associativité

source: Apply associativity on {}
fr_fr: Associativité appliquée à {}

source: Select only one object
fr_fr: Sélectionner un seul objet

source: Triangular inequality {} added to the context
fr_fr: Inégalité triangulaire {} ajoutée au contexte

source: the target
fr_fr: le but

source: No absolute value found in {}
fr_fr: Je n'ai pas trouvé de valeur absolue dans {}

source: Select only one object at a time
fr_fr: Sélectionner un seul objet à la fois

source: Target simplified
fr_fr: Le but a été simplifié

source: Property {} simplified
fr_fr: La propriété {} a été simplifiée

source: Unable to simplify
fr_fr: Je ne sais pas simplifier ceci

source: Missing selection
fr_fr: Sélection manquante

source: (the logical calculator is not activated)
fr_fr: (la calculatrice logique n'est pas activée)

source: Apply a universal context property
fr_fr: Appliquer une propriété universelle du contexte

source: Apply a universal statement
fr_fr: Appliquer un énoncé universel
