Repository: dEAduction/dEAduction
Catalog: src/deaduction/share/locales/*/LC_MESSAGES/deaduction.po
Languages: fr_fr

source: a sequence
fr_fr: une suite

source: sequences
fr_fr: suites

source: non-negative integers
fr_fr: entiers positifs ou nuls

source: integers
fr_fr: nombres entiers

source: rational numbers
fr_fr: nombres rationnels

source: real numbers
fr_fr: nombres réels

source: every proposition
fr_fr: chaque proposition

source: every set
fr_fr: chaque ensemble

source: every subset
fr_fr: chaque sous-ensemble

source: every element
fr_fr: chaque élément

source: every function
fr_fr: chaque fonction

source: every sequence
fr_fr: chaque suite

source: every non-negative integer
fr_fr: tout entier positif ou nul

source: every integer
fr_fr: tout entier relatif

source: every rational number
fr_fr: tout nombre rationnel

source: every real number
fr_fr: tout nombre réel

source: Examples of syntax:
fr_fr: Exemples de syntaxe :

source: x ∈ A ∩ B --> x belongs (A cap B) A ⊂ B --> A subset B A = ∅ --> A = emptyset ∀x ∈ A ∩ A', x ∈ A --> forall x belongs (A cap A'), x belongs A
fr_fr: x ∈ A ∩ B —> x dans (A inter B) A ⊂ B —> A inclus B A = ∅ —> A = vide ∀x ∈ A ∩ A’, x ∈ A —> forall x dans (A inter A’), x dans A

source: You can use the keywords and, or, not, implies, iff, forall, exists.
fr_fr: Vous pouvez utiliser les mots-clés et, ou, non, implique, ssi, forall, exists.

source: In case of error, try with more parentheses.
fr_fr: En cas d’erreur, essayez avec plus de parenthèses.

source: A ∩ B --> A cap B A ∪ B --> A cup B X \ A --> complement A f(A) --> f direct_image A f⁻¹(A) --> f inverse_image A f∘g (x) --> (composition f g)(x) {x} --> sing x {x, x'} --> pair x x' And also f(x) ; x+1/2 ; 2*n, max m n, abs x, epsilon...
fr_fr: A ∩ B —> A inter B A ∪ B —> A union B X \ A —> complement A f(A) —> f image_directe A f⁻¹(A) —> f image_reciproque A f∘g (x) —> (composition f g)(x) {x} —> sing x {x, x’} —> pair x x’ Et aussi f(x) ; x+1/2 ; 2*n, max m n, abs x, epsilon...

source: function
fr_fr: fonction

source: element
fr_fr: élément

source: subset
fr_fr: partie

source: a family
fr_fr: une famille

source: family
fr_fr: famille

source: Set Theory
fr_fr: Théorie Des Ensembles

source: A singleton (set with one element)
fr_fr: Un singleton (ensemble à un élément)

source: A pair (set with two elements
fr_fr: Une paire (ensemble à deux éléments)

source: The image of a subset under a function
fr_fr: Image d'un sous-ensemble par une application

source: The inverse image of a subset under a function
fr_fr: Image réciproque d'un sous-ensemble par une application

source: The set of subsets of a set.
fr_fr: L’ensemble des parties d'un ensemble

source: A set of functions
fr_fr: Un ensemble de fonctions

source: Functions
fr_fr: Fonctions

source: Application of a function to an element\nor term of a sequence.
fr_fr: Application d'une fonction à un élément ou terme d'une suite

source: Composition of two functions
fr_fr: Composition de deux applications

source: Define a function
fr_fr: Définir une fonction

source: Numbers
fr_fr: Nombres

source: -? or ?-?
fr_fr: -? ou ?-?

source: Absolute value
fr_fr: Valeur absolue

source: Inequalities
fr_fr: Inégalités

source: Definitions
fr_fr: Définitions

source: for every subset
fr_fr: pour toute partie

source: of
fr_fr: de

source: for every function
fr_fr: pour toute fonction

source: from
fr_fr: de

source: to
fr_fr: dans

source: for every proposition
fr_fr: pour toute proposition

source: for every set
fr_fr: pour tout ensemble

source: for every sequence {} of elements of {}, {}
fr_fr: pour toute suite {} d'éléments de {}, {}

source: there exists a set
fr_fr: il existe un ensemble

source: such that
fr_fr: tel que

source: there exists a sequence {} of elements of {} such that {}
fr_fr: il existe une suite {} d'éléments de {} telle que {}

source: there exists a unique proposition {} such that {}
fr_fr: il existe une unique proposition {} telle que {}

source: there exists a unique set
fr_fr: il existe un unique ensemble

source: there exists a unique sequence {} of elements of {} such that {}
fr_fr: il existe une unique suite {} d'éléments de {} telle que {}

source: does not divide
fr_fr: ne divise pas

source: All goals reached!
fr_fr: Tous les buts ont été atteints !

source: elements of
fr_fr: éléments de

source: Step n°{}
fr_fr: Etape n°{}

source: Package check error: {}
fr_fr: Erreur de vérification de paquet : {}

source: Failed to check for folder at {}
fr_fr: Echec de vérification du dossier dans {}

source: Failed to write in folder {}
fr_fr: Echec d'écriture dans le dossier {}

source: Checking package folder for {}
fr_fr: Vérification du dossier de paquet pour {}

source: Checking files for {}
fr_fr: Vérification des fichiers dans {}

source: Missing files {}, reinstalling package!
fr_fr: Fichiers manquant {}, le paquet doit être réinstallé !

source: Additional file {} found in directory
fr_fr: Fichier additionnel {} trouvé dans le dossier

source: File {} is invalid, reinstalling package
fr_fr: Fichier {} non valide, le paquet doit être réinstallé

source: Installing package {} from archive
fr_fr: Installation du paquet {} depuis l’archive

source: Invalid checksum: {}, expected {}
fr_fr: Somme de contrôle invalide : {}, somme attendue {}

source: Invalid archive type {}
fr_fr: Type d’archive invalide : {}

source: Temporary path is {}
fr_fr: Le dossier temporaire est {}

source: → Move {} to {}
fr_fr: → Dossier {} déplacé vers {}

source: Extract file to {}
fr_fr: Extraction du fichier vers {}

source: Unable to extract file
fr_fr: Impossible d'extraire le fichier

source: Failed to install Package to {}: {}
fr_fr: Echec dans l’installation du paquet {}: {}

source: Installed Package to {}
fr_fr: Paquet installé dans {}

source: Found differences in files, reinstall.
fr_fr: Différences dans les fichiers, ré-installer.

source: Expecting {}, but this is {}
fr_fr: On attend {}, mais c'est {}

source: Definition:
fr_fr: Définition :

source: Theorem:
fr_fr: Théorème :

source: All proof states received
fr_fr: Etats de preuve reçu

source: Proof complete
fr_fr: La preuve est terminée !

source: Assume that
fr_fr: Supposons que

source: the negation
fr_fr: la négation

source: Assume
fr_fr: Supposons

source: Prove that
fr_fr: Démontrer que

source: Prove
fr_fr: Démontrer

source: Then
fr_fr: Alors

source: Hypothesis:
fr_fr: Hypothèse :

source: Hypotheses:
fr_fr: Hypothèses :

source: Context:
fr_fr: Contexte :

source: Goal:
fr_fr: But :

source: Proof of first property: {}
fr_fr: Preuve de la première propriété : {}

source: Proof of second property: {}
fr_fr: Preuve de la seconde propriété : {}

source: Proof of first implication: {}
fr_fr: Preuve de la première implication : {}

source: Proof of second implication: {}
fr_fr: Preuve de la seconde implication : {}

source: Fist case:
fr_fr: Premier cas :

source: Second case:
fr_fr: Second cas :

source: assuming {}
fr_fr: en supposant {}

source: Proof of new subgoal: {}
fr_fr: Preuve du but intermédiaire : {}

source: Proof of new subgoal
fr_fr: Preuve du but intermédiaire

source: no message
fr_fr: pas de message

source: ERROR:
fr_fr: ERREUR :

source: Success:
fr_fr: Succès :

source: (Current goal admitted)
fr_fr: (But en cours admis)

source: Beginning of Proof
fr_fr: Début de la preuve

source: No more goal!
fr_fr: Tous les buts ont été atteints!

source: Pushing negation
fr_fr: Négation poussée

source: Contraposition
fr_fr: Contraposée

source: First case
fr_fr: Premier cas

source: Second case
fr_fr: Second cas

source: Proof of first implication
fr_fr: Preuve de la première implication

source: Proof of second implication
fr_fr: Preuve de la seconde implication

source: Proof of {}
fr_fr: Preuve de {}

source: Proof of first property
fr_fr: Preuve de la première propriété

source: Proof of second property
fr_fr: Preuve de la seconde propriété

source: Back to proof of {}
fr_fr: Retour à la preuve de {}

source: Proof of sub-goal: {}
fr_fr: Preuve du but intermédiaire : {}

source: Proof State received
fr_fr: Etat de preuve reçu

source: After request
fr_fr: Après la requête

source: error
fr_fr: erreur

source: the '{}' button
fr_fr: le bouton '{}'

source: the '{}' button in prove mode
fr_fr: le bouton '{}' en mode Démontrer

source: the 'prove {}' button
fr_fr: le bouton 'Démontrer {}'

source: the '{}' button in use mode
fr_fr: le bouton '{}' en mode Utiliser

source: the 'use {}' button
fr_fr: le bouton 'Utiliser {}'

source: universal property
fr_fr: propriété universelle

source: existential property
fr_fr: propriété existentielle

source: conjunction
fr_fr: conjonction

source: disjunction
fr_fr: disjonction

source: negation
fr_fr: négation

source: logical equivalence
fr_fr: équivalence logique

source: equality
fr_fr: égalité

source: This is
fr_fr: Ceci est

source: This property is
fr_fr: Cette propriété est

source: Applying definition {def_name} will turn this into
fr_fr: En appliquant la définition {def_name}, ceci deviendra

source: To use this property
fr_fr: Pour utiliser cette propriété

source: To start a proof of this property
fr_fr: Pour commencer à démontrer cette propriété

source: To use this property directly
fr_fr: Pour utiliser directement cette propriété

source: To start a proof of this property directly
fr_fr: Pour commencer à démontrer directement cette propriété

source: press
fr_fr: cliquez sur

source: pressing
fr_fr: en cliquant sur

source: after selecting it
fr_fr: après l'avoir sélectionnée

source: or drag the element and drop it onto the property
fr_fr: ou glissez l'élément jusqu'à la propriété

source: or drag the premise and drop it onto the property
fr_fr: ou glissez la prémisse jusqu'à la propriété

source: or drag the property and drop it onto the equality
fr_fr: ou glissez la propriété sur l'égalité

source: or drag the element or the equality and drop it onto the function
fr_fr: ou glissez l'élément ou l'égalité sur la fonction

source: or drag the property and drop it onto the definition
fr_fr: ou glissez la propriété jusqu'à la définition

source: {this_is} a universal property, which tells something about {every_element_of_type_}.
fr_fr: {this_is} une propriété universelle, qui dit quelque chose sur {every_element_of_type_}.

source: {to_use}, you need {an_element_of_type_}. Is there any in the context? If not, can you create some?
fr_fr: {to_use}, il vous faut {an_element_of_type_}. Y en a-t-il un dans le contexte ? Sinon, comment en obtenir un ?

source: {to_start_proof}, press {prove_forall}.
fr_fr: {to_start_proof}, cliquez sur {prove_forall}.

source: It is generally a good idea to simplify the target as much as possible by introducing all variables and hypotheses in the context.
fr_fr: En général, c'est une bonne idée de simplifier le but jusqu'à ce qu'il soit le plus simple possible, en introduisant les variables et les hypothèses dans le contexte.

source: {this_is} an implication, which asserts that some property P, the <b>premise</b>:<CENTER>{ch0},</CENTER> implies some other property Q, the <b>conclusion</b>:<CENTER>{ch1}.<CENTER>
fr_fr: {this_is} une implication, qui dit qu'une propriété P, la <b>prémisse</b> :<CENTER>{ch0},</CENTER> implique une autre propriété Q, la <b>conclusion</b> :<CENTER>{ch1}.</CENTER>

source: {to_use}, {press} {use_implies} {after_selecting_it} and another property which match the premise{or_drag_premise}.<p>If the premise is not in the context, you can start proving it by selecting only this implication and {pressing} {use_implies}.</p>
fr_fr: {to_use}, {press} {use_implies} {after_selecting_it} ainsi qu'une autre propriété qui correspond à la prémisse{or_drag_premise}.<p>Si la prémisse n'est pas dans le contexte, vous pouvez la démontrez en sélectionnant seulement cette implication et {pressing} {use_implies}.</p>

source: {to_use}, you need property {ch0}. Does it appear in the context?
fr_fr: {to_use}, il vous faut la propriété {ch0}. Apparait-elle dans le contexte ?

source: {to_start_proof}, press {prove_implies}.
fr_fr: {to_start_proof}, cliquez sur {prove_implies}.

source: Note that an implication may also be proved by contraposition (see the "Proof methods" button).
fr_fr: On peut aussi démontrer une implication en utilisant la contraposée (voir le bouton "Méthodes de preuves").

source: {this_is} an existential property, which asserts the existence of {an_element_of_type_} satisfying a precise property.
fr_fr: {this_is} une propriété existentielle, qui affirme l'existence d'{an_element_of_type_} vérifiant une propriété précise.

source: {to_use}, just press {use_exists}.
fr_fr: {to_use}, cliquez simplement {use_exists}.

source: {to_start_proof}, press {prove_exists} to enter an element that satisfies this property.
fr_fr: {to_start_proof}, cliquez sur {prove_exists} pour entrer un élément qui satisfait cette propriété.

source: Is there {an_element_of_type_} in the context? If this is so, does it suits your needs? If not, how can you create some?
fr_fr: Y a-t-il {an_element_of_type_} dans le contexte ? Si oui, est-ce qu'il convient ? Sinon, pouvez-vous en obtenir un ?

source: {this_property_is} a disjunction.
fr_fr: {this_property_is} une disjonction.

source: Press {use_or} to engage in a proof by cases; you will successively examine the case when {ch0} holds and the case when {ch1} holds.
fr_fr: Cliquez sur {use_or} pour débuter une preuve par cas ; vous examinerez alors successivement le cas où {ch0}, puis le cas où {ch1}.

source: Would it help you to know which one of the two properties hold?
fr_fr: Est-ce que ça vous aiderait de savoir laquelle des deux propriétés est vérifiée ?

source: <p>If so, then you could consider engaging in a proof by cases.</p>
fr_fr: <p>Si oui, alors vous pourriez envisager une preuve par cas.</p>

source: Press {prove_or} to simplify the goal by deciding which one of the two properties you will prove. You may forget about the other one!
fr_fr: Cliquez sur {prove_or} pour simplifier le but en décidant laquelle des deux propriétés vous aller montrer. Vous pouvez oublier l'autre propriété !

source: Do you have enough information in the context to prove one of these two properties?
fr_fr: Avez-vous assez d'information dans le contexte pour démontrer l'une de ces deux propriétés ?

source: If this is so, then choose this property with the ∨ (OR) button.
fr_fr: Si oui, alors vous pouvez choisir cette propriété avec le bouton ∨ (OR).

source: If not, you should first get more information.
fr_fr: Sinon, vous devriez d'abord obtenir plus d'informations.

source: {this_property_is} a conjunction.
fr_fr: {this_property_is} une conjonction.

source: Press {use_and} to separate both properties.
fr_fr: Cliquez sur {use_and} pour séparer les deux propriétés.

source: Press {prove_and} to prove separately and successively each property.
fr_fr: Cliquez sur {prove_and} pour démontrer séparément et successivement chacune des deux propriétés.

source: Note that you will have to prove <b> both </b> properties, as opposed to disjunction for which you may choose which property you prove.
fr_fr: Notez bien que vous devrez démontrer <b>les deux</b> propriétés, contrairement aux disjonctions pour lesquelles vous pouvez <b>choisir</b> la propriété à démontrer.

source: {this_property_is} a negation.
fr_fr: {this_property_is} une négation.

source: Press the ¬ (NOT) button to try to simplify the property.
fr_fr: Cliquez sur le bouton ¬ (NON) pour essayer de simplifier la propriété.

source: I do not know how to simplify this negation directly.
fr_fr: Je ne sais pas simplifier cette négation sous cette forme.

source: {this_property_is} a logical equivalence.
fr_fr: {this_property_is} une équivalence logique.

source: You can use the ⇔ ("IF AND ONLY IF") button <ul>
fr_fr: Vous pouvez utiliser le bouton ⇔ ("SI ET SEULEMENT SI")<ul>

source: <li>to split it into two implications,</li>
fr_fr: <li>pour la décomposer en deux implications,</li>

source: <li>or to substitute {ch0} for {ch1}, or vice-versa, in the target or in some other property of the context.</li></ul>
fr_fr: <li>ou pour remplacer {ch0} par {ch1}, ou vice-versa, dans le but ou dans une autre propriété du contexte.</li></ul>

source: Press the ⇔ ("IF AND ONLY IF") button, to split the proof into the proofs of the direct and reverse implications. You may also use {prove_and}.
fr_fr: Cliquez sur le bouton ⇔ ("SI ET SEULEMENT SI"), pour démontrer séparément l'implication directe et l'implication réciproque. Vous pouvez aussi utiliser {prove_and}.

source: {this_is} an equality between two {elements_of_ch0_type}.
fr_fr: {this_is} une égalité entre deux {elements_of_ch0_type}.

source: You may use this equality to substitute {ch0} for {ch1}, or vice-versa, in the target or in some other property of the context.
fr_fr: Vous pouvez utiliser cette égalité pour remplacer {ch0} par {ch1}, ou vice-versa, dans le but ou dans une autre propriété du contexte.

source: <p>To do this, press the "=" ( EQUAL) button after selecting the other property{or_drag_to_equality}.</p>
fr_fr: <p>Pour ça, cliquez sur le bouton "=" (ÉGAL) après avoir sélectionné l'autre propriété{or_drag_to_equality}.</p>

source: {this_is} a function from {ch0} to {ch1}.
fr_fr: {this_is} une fonction de {ch0} dans {ch1}.

source: You may apply this function to some element of {ch0}, or to an equality between two elements of {ch0}.
fr_fr: Vous pouvez appliquer cette fonction à un élément de {ch0}, ou à une égalité entre deux éléments de {ch0}.

source: <p>For this, press the ↦ (MAP) button after selecting an element or an equality{or_drag_to_function}.</p>
fr_fr: <p>Pour ça, cliquez sur le bouton ↦ (FONCTION) après avoir sélectionné un élément ou une égalité{or_drag_to_function}.</p>

source: {this_is} a belonging property.
fr_fr: {this_is} une propriété d'appartenance.

source: There is no obvious way to further simplify this target. Maybe you should now work on the context, trying to get this property.
fr_fr: Il n'y a pas de façon évidente de simplifier ce but. Vous pouvez maintenant essayer de déduire ce but à partir des propriétés du contexte.

source: This matches the definition {def_name}.
fr_fr: Vous pouvez appliquer la définition {def_name}.

source: To apply a definition, click on it in the Statements area{or_drag_to_def}.
fr_fr: Pour appliquer une définition, cliquez dessus dans la zone des énoncés{or_drag_to_def}.

source: This matches definitions {def_names}.
fr_fr: On peut appliquer les définitions {def_names}.

source: This property obviously entails the current goal.
fr_fr: Cette propriété implique manifestement le but en cours.

source: Use the "Goal!" button when you think the target is obvious from the context.
fr_fr: Utilisez le bouton "But!" quand vous pensez que le but se déduit manifestement du contexte.

source: Maybe {deaduction} will still need a little help...
fr_fr: {deaduction} vous demandera peut-être de l'aider encore un peu...

source: This target follows obviously from context property {solving_obj}.
fr_fr: Ce but se déduit manifestement de la propriété {solving_obj} du contexte.

source: Proof complete (but for some admitted goals)
fr_fr: La preuve est terminée (mais certains buts ont été admis)

source: Prove '∀ x, P(x)' by introducing 'x'
fr_fr: Démontre ‘∀ x, P(x)’ en introduisant ‘x’

source: From some 'x' and '∀ y, P(y)' get 'P(x)'
fr_fr: D’un objet ‘x’ et ‘∀ y, P(y)’, déduit ‘P(x)’

source: Prove '∃ x, P(x)' by specifying some 'x'
fr_fr: Prouve ‘∃ x, P(x)’ en choisissant ‘x’ et en prouvant ‘P(x)’

source: From '∃ x, P(x)' get an 'x' and 'P(x)'
fr_fr: De ‘∃ x, P(x)’ obtient un ‘x’ et la propriété ‘P(x)’

source: Prove 'P ⇒ Q' by assuming 'P', and proving 'Q'
fr_fr: Démontre ‘P ⇒ Q’ en supposant ‘P’, et en démontrant ‘Q’

source: From 'P' and 'P ⇒ Q' get 'Q'
fr_fr: De 'P' et 'P ⇒ Q' déduit 'Q'

source: Prove the property 'P AND Q' by proving separately 'P' and 'Q'
fr_fr: Prouve ‘P ET Q’ en prouvant séparément ‘P’ et ‘Q’

source: From the property 'P AND Q', get 'P' and 'Q'
fr_fr: A partir de la propriété ‘P ET Q’, obtenir les deux propriétés ‘P’, ‘Q’

source: Prove 'P OR Q' by choosing to prove either 'P' or 'Q'
fr_fr: Prouve ‘P OU Q’ en choisissant de prouver ‘P’ ou bien ‘Q’

source: Use property 'P OR Q' by splitting cases
fr_fr: Utilise la propriété ‘P OU Q’ en distinguant les cas

source: Try to simplify the property 'NOT P'
fr_fr: Essaie de simplifier la propriété ‘NON P’

source: Split 'P ⇔ Q' into two implications
fr_fr: Sépare ‘P ⇔ Q’ en deux implications

source: From 'P ⇒ Q' and 'Q ⇒ P' get 'P ⇔ Q'
fr_fr: De 'P ⇒ Q' et 'Q ⇒ P' déduit 'P ⇔ Q'

source: Use an equality to substitute one term with the other
fr_fr: Appliquer une égalité ou un « si et seulement si » pour substituer dans une propriété sélectionnée

source: Apply a function to an element or an equality
fr_fr: Appliquer une fonction à un élément ou à une égalité

source: Choose some specific proof method
fr_fr: Choisir une méthode de preuve

source: Create a new object (e.g. 'f(x)' from 'f' and 'x'
fr_fr: Créer un nouvel objet (par ex. ‘f(a)’, ‘ε/2’, …)

source: Create a new subgoal (a lemma)
fr_fr: Créer un nouveau but (un lemme intermédiaire)

source: Create a function from X to Y from property '∀ x ∈ X, ∃ y ∈ Y, P(x,y)'
fr_fr: A partir d’une propriété ‘∀ x ∈ X, ∃ y ∈ Y, P(x,y)’, obtenir une fonction de X dans Y

source: Terminate the proof when the target is obvious from the context
fr_fr: Conclut la preuve lorsque le but est évident à partir du contexte

source: Add equalities or inequalities
fr_fr: Ajouter des égalités ou des inégalités

source: Substract or take the opposite of equalities or inequalities
fr_fr: Soustraire ou prendre l'opposé d'égalités ou d'inégalités

source: Obtain a triangular inequality adapted to a selected equality or inequality
fr_fr: Obtenir une inégalité triangulaire adaptée à l'égalité ou l'inégalité sélectionnée

source: Try to simplify expression
fr_fr: Essaie de simplifier une expression

source: Use a commutativity rule
fr_fr: Appliquer une règle de commutativité

source: Use an associativity rule
fr_fr: Appliquer une règle d'associativité

source: Use a transitivity rule, e.g. for chaining inequalities
fr_fr: Appliquer une règle de transitivité, par exemple pour enchainer des inégalités

source: Replace "..." in object, property or goal by a suitable formula
fr_fr: Remplacer "..." dans un objet ou dans le but par ce qui convient

source: Use a joker as your witness
fr_fr: Utiliser un joker comme témoin

source: FORALL
fr_fr: POUR TOUT

source: EXISTS
fr_fr: EXISTE

source: IMPLIES
fr_fr: IMPLIQUE

source: AND
fr_fr: ET

source: OR
fr_fr: OU

source: PROVE FORALL
fr_fr: DEMONTRE POUR TOUT

source: PROVE EXISTS
fr_fr: DEMONTRE EXISTE

source: PROVE IMPLIES
fr_fr: DEMONTRE IMPLIQUE

source: PROVE AND
fr_fr: DEMONTRE ET

source: PROVE OR
fr_fr: DEMONTRE OU

source: USE FORALL
fr_fr: UTILISE POUR TOUT

source: USE EXISTS
fr_fr: UTILISE EXISTE

source: USE IMPLIES
fr_fr: UTILISE IMPLIQUE

source: USE AND
fr_fr: UTILISE ET

source: USE OR
fr_fr: UTILISE OU

source: NOT
fr_fr: NON

source: IFF
fr_fr: SSI

source: EQUAL
fr_fr: ÉGAL

source: MAP
fr_fr: APPLICATION

source: NEW OBJECT
fr_fr: NOUVEL OBJET

source: PROOF METHODS
fr_fr: METHODES DE PREUVES

source: ASSUMPTION
fr_fr: BUT

source: SUM
fr_fr: PLUS

source: MINUS
fr_fr: MOINS

source: TRANSITIVITY
fr_fr: TRANSITIVITÉ

source: ASSOCIATIVITY
fr_fr: ASSOCIATIVITÉ

source: COMMUTE
fr_fr: COMMUTATIVITÉ

source: TRIANGULAR INEQUALITY
fr_fr: INÉGALITÉ TRIANGULAIRE

source: SIMPLIFY
fr_fr: SIMPLIFIER

source: COMPLETE
fr_fr: COMPLETER

source: Proof methods...
fr_fr: Méthodes de preuve…

source: New object...
fr_fr: Nouvel Objet…

source: Compute
fr_fr: Calculer

source: prove
fr_fr: démontrer

source: use
fr_fr: utiliser

source: File {} not found
fr_fr: Fichier {} non trouvé

source: Path {} is not a directory
fr_fr: Le dossier {} n’existe pas
